In [3]:
import requests
import json
import pickle
import pandas as pd

In [4]:
check_json_2 = {
            'Pclass' :[0,1],
            'Sex':["female","male"],
            'Age':[12,45],
            'SibSp':[1,1],
            'Parch':[0,1],
            'Fare':[0,0],
            'Embarked' :["S","Q"]
}

In [5]:
pd.DataFrame(check_json_2)

   Pclass     Sex  Age  SibSp  Parch  Fare Embarked
0       0  female   12      1      0     0        S
1       1    male   45      1      1     0        Q

### My personal account OCI OKE EndPoint :

In [6]:
url_oke = 'http://152.67.24.54:5000/pred'

In [7]:
r = requests.post(url_oke, json=check_json_2)

In [8]:
r

In [9]:
r.json()

[0.2917799015292492, 0.2825939009854157]

In [10]:
mydata = pd.DataFrame(check_json_2)

In [11]:
mydata['outlier'] = r.json()

In [12]:
mydata

   Pclass     Sex  Age  SibSp  Parch  Fare Embarked   outlier
0       0  female   12      1      0     0        S  0.291780
1       1    male   45      1      1     0        Q  0.282594

* **Now, send the data to Database, etc.**